'''1. РћРїСЂРµРґРµР»РµРЅРёРµ РєРѕР»РёС‡РµСЃС‚РІР° СЂР°Р·Р»РёС‡РЅС‹С… РїРѕРґСЃС‚СЂРѕРє СЃ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµРј С…РµС€-С„СѓРЅРєС†РёРё. РџСѓСЃС‚СЊ РЅР° РІС…РѕРґ С„СѓРЅРєС†РёРё РґР°РЅР° СЃС‚СЂРѕРєР°.
РўСЂРµР±СѓРµС‚СЃСЏ РІРµСЂРЅСѓС‚СЊ РєРѕР»РёС‡РµСЃС‚РІРѕ СЂР°Р·Р»РёС‡РЅС‹С… РїРѕРґСЃС‚СЂРѕРє РІ СЌС‚РѕР№ СЃС‚СЂРѕРєРµ.
РџСЂРёРјРµС‡Р°РЅРёСЏ:
* РІ СЃСѓРјРјСѓ РЅРµ РІРєР»СЋС‡Р°РµРј РїСѓСЃС‚СѓСЋ СЃС‚СЂРѕРєСѓ Рё СЃС‚СЂРѕРєСѓ С†РµР»РёРєРѕРј;
* Р±РµР· РёСЃРїРѕР»СЊР·РѕРІР°РЅРёСЏ С„СѓРЅРєС†РёР№ РґР»СЏ РІС‹С‡РёСЃР»РµРЅРёСЏ С…СЌС€Р° (hash(), sha1() РёР»Рё Р»СЋР±РѕР№ РґСЂСѓРіРѕР№ РёР· РјРѕРґСѓР»СЏ hashlib
Р·Р°РґР°С‡Р° СЃС‡РёС‚Р°РµС‚СЃСЏ РЅРµ СЂРµС€С‘РЅРЅРѕР№.'''

import hashlib

string = input('Р’РІРµРґРёС‚Рµ СЃС‚СЂРѕРєСѓ РёР· РјР°Р»РµРЅСЊРєРёС… Р»Р°С‚РёРЅСЃРєРёС… Р±СѓРєРІ  ')

sum_substring = set()

for i in range(len(string)):
    for j in range(len(string), i, -1):
        hash_str = hashlib.sha1(string[i:j].encode('utf-8')).hexdigest()
        sum_substring.add(hash_str)

print(f'{len(sum_substring) -1} СЂР°Р·Р»РёС‡РЅС‹С… РїРѕРґСЃС‚СЂРѕРє РІ СЃС‚СЂРѕРєРµ {string}')